#include <stdio.h>
#include <locale.h>

typedef struct {
    char name[50];
    char capital[50];
    char lang[50];
    char currency[50];
    int square;
} Country;

int main() {
	setlocale(LC_NUMERIC, "");

    Country array[10] = {
        {"США", "Вашингтон", "Английский", "Доллар", 9826675},
        {"Индия", "Нью-Дели", "Хинди", "Рупия", 3287263},
        {"Россия", "Москва", "Русский", "Рубль", 17125191},
        {"Япония", "Токио", "Японский", "Иена", 377976},
        {"Сингапур", "Сингапур", "Малайский", "Доллар", 735},
        {"Австралия", "Канберра", "Английский", "Доллар", 7692024},
        {"Турция", "Анкара", "Турецкий", "Лира", 783562},
        {"Румыния", "Бухарест", "Румынский", "Лей", 238391},
        {"Франция", "Париж", "Французский", "Евро", 551500},
        {"Италия", "Рим", "Итальянский", "Евро", 302070}
    };

    int sum = 0;
    for (int i = 0; i < 10; i++) {
        sum += array[i].square;
    }
    int sr = sum / 10;

    printf("Средняя площадь: %'d км²\n", sr);
    for (int i = 0; i < 10; i++) {
        if (array[i].square < sr) {
            printf("%s (%'d)\n", array[i].name, array[i].square);
        }
    }

    return 0;
}
